Canuto371/TE2003B_501_Practices/Proyecto Final/Quinto_Completo/5to/MKL25Z4_Project_FruitXpress_E1/source/MKL25Z4_Project_Bomba.c
#include <MKL25Z4.h>
#include "hal_gpio.h"
#include "mcal_gpio.h"
#include <stdint.h>
#include <stdbool.h>

/* --- PIN DEFINITIONS --- */
// LCD 4-bit control pins (PTA)
#define RS  0x04   // PTA2
#define RW  0x10   // PTA4
#define EN  0x20   // PTA5

// HC-SR04 sensor pins
#define TRIG_PIN   1    // PTD1
#define ECHO_PIN   12   // PTA12
#define UMBRAL_CM  14   // umbral de disponibilidad (14 cm)

// Pump GPIO pin (PTA1)
#define BOMB_PIN   1U   // PTA1

/* --- TIEMPOS / DEMORAS --- */
void delayMs(int n);
void delayUs(int n);

void SysTick_Init(void);
uint32_t micros(void);

void TPM0_Init(void);

/* --- KEYPAD --- */
void keypad_init(void);
char keypad_getkey(void);
char convert_key(unsigned char key);

/* --- LCD --- */
void LCD_init(void);
void LCD_command(unsigned char command);
void LCD_data(unsigned char data);
void LCD_print(char *str);
void send_nibble(unsigned char nibble);

/* --- FUNCIONES DEL SENSOR HC-SR04 --- */
uint32_t medir_distancia_cm(void);

/* --- MENÚS --- */
void show_main_menu(void);
void show_selection_menu(void);

/* --- MANEJO NIVEL DE TANQUE Y BOMBA --- */
uint8_t check_level(int n);

/* ==================== MAIN ==================== */
int main(void) {
    __enable_irq();

    // 1) Actualizar reloj y configurar SysTick -> micros()
    SystemCoreClockUpdate();
    SysTick_Init();

    // 2) Inicializar TPM0 antes de cualquier delayUs()/delayMs()
    TPM0_Init();

    // 3) Ahora sí inicializar teclado y LCD, que usan delayUs()/delayMs()
    keypad_init();
    LCD_init();

    // 4) Inicializar pines del HC-SR04 y la bomba (HAL/MCAL)
    HAL_GPIO_InitOutput(&GPIOD_Info, TRIG_PIN);
    HAL_GPIO_InitInput(&GPIOA_Info, ECHO_PIN);
    HAL_GPIO_InitOutput(&GPIOA_Info, BOMB_PIN);
    HAL_GPIO_Write(&GPIOA_Info, BOMB_PIN, 0);

    // 5) Mostrar menú principal
    show_main_menu();

    while (1) { /* no debe llegar aquí */ }
    return 0;
}

/* ==================== MENÚ PRINCIPAL ==================== */
void show_main_menu(void) {
    while (1) {
        LCD_command(0x01); // clear
        delayMs(10);

        LCD_command(0x80); // primera línea
        LCD_print("!FruitXpress!");
        LCD_command(0xC0); // segunda línea
        LCD_print("Oprima # para...");

        // Espera hasta que se presione '#' o '*'
        unsigned char key = 0;
        while ((key = keypad_getkey()) == 0) {
            ; // loop hasta que haya tecla
        }
        char keyChar = convert_key(key);
        // Debounce: esperar a que se suelte
        while (keypad_getkey() == key) {
            delayMs(50);
        }

        if (keyChar == '#') {
            // Avanzar al menú de selección
            LCD_command(0x01);
            delayMs(10);
            LCD_command(0x80);
            LCD_print("Elige un sabor:");
            delayMs(1000);
            show_selection_menu();
            // Después de regresar de show_selection_menu, volvemos a mostrar este menú
        }
        else {
            // Cualquier otra tecla simplemente refresca el menú
            continue;
        }
    }
}

/* ==================== MENÚ DE SELECCIÓN ==================== */
void show_selection_menu(void) {
    while (1) {
        LCD_command(0x01);
        delayMs(10);

        // Mostrar opciones
        LCD_command(0x80);
        LCD_print("1:Naranja 2:Uva");
        LCD_command(0xC0);
        LCD_print("3:Fresa 4:Cancelar");
        delayMs(500);

        unsigned char key = keypad_getkey();
        if (key) {
            char keyChar = convert_key(key);
            // Debounce
            while (keypad_getkey() == key) {
                delayMs(50);
            }

            if (keyChar == '1') {
                LCD_command(0x01);
                LCD_print("Naranja seleccion.");
                delayMs(1000);
                check_level(1);
                return; // Regresar al menú principal después de check_level
            }
            else if (keyChar == '2') {
                // Por ahora, sin funcionalidad
                LCD_command(0x01);
                LCD_print("Uva: Sin implementar");
                delayMs(1000);
                return;
            }
            else if (keyChar == '3') {
                // Por ahora, sin funcionalidad
                LCD_command(0x01);
                LCD_print("Fresa: Sin implementar");
                delayMs(1000);
                return;
            }
            else if (keyChar == '4') {
                // Cancelar → volver al menú principal
                return;
            }
            else {
                // Entrada inválida → simplemente refrescar
                LCD_command(0x01);
                LCD_print("Entrada invalida");
                delayMs(1000);
                return;
            }
        }
    }
}

/* ==================== FUNCIÓN check_level ====================
 * check_level(1): lee distancia con HC-SR04; si < UMBRAL_CM, enciende
 * la bomba 3 seg (no bloqueante con delay), muestra mensajes en LCD,
 * luego regresa al menú principal.
 *
 * n=2 y n=3 quedan vacíos por ahora.
 */
uint8_t check_level(int n) {
    if (n == 1) {
        // 1) Medir distancia
        uint32_t dist_cm = medir_distancia_cm();

        // 2) Formatear cadena de distancia
        char buffer[7] = {'0','0',' ','c','m','\0','\0'};
        if (dist_cm != 0xFFFFFFFFU) {
            if (dist_cm >= 100) {
                buffer[0] = '0' + ((dist_cm / 100) % 10);
                buffer[1] = '0' + ((dist_cm / 10) % 10);
                buffer[2] = '0' + (dist_cm % 10);
                buffer[3] = 'c';
                buffer[4] = 'm';
                buffer[5] = '\0';
            }
            else if (dist_cm >= 10) {
                buffer[0] = '0' + (dist_cm / 10);
                buffer[1] = '0' + (dist_cm % 10);
                buffer[2] = ' ';
                buffer[3] = 'c';
                buffer[4] = 'm';
                buffer[5] = '\0';
            }
            else {
                buffer[0] = '0';
                buffer[1] = '0' + (dist_cm % 10);
                buffer[2] = ' ';
                buffer[3] = 'c';
                buffer[4] = 'm';
                buffer[5] = '\0';
            }
        }
        else {
            // Timeout o error
            buffer[0] = '-';
            buffer[1] = '-';
            buffer[2] = ' ';
            buffer[3] = 'c';
            buffer[4] = 'm';
            buffer[5] = '\0';
        }

        // 3) Mostrar distancia en LCD (primera línea)
        LCD_command(0x01);
        delayMs(10);
        LCD_command(0x80);
        for (int i = 0; buffer[i] != '\0'; i++) {
            LCD_data((unsigned char)buffer[i]);
        }

        // 4) Mostrar disponibilidad (segunda línea)
        LCD_command(0xC0);
        if ((dist_cm != 0xFFFFFFFFU) && (dist_cm < UMBRAL_CM)) {
            LCD_print(" Disponible ");
            // 5) Si está disponible, activar bomba 3 segundos
            HAL_GPIO_Write(&GPIOA_Info, BOMB_PIN, 1); // Bomba ON
            uint32_t t_start = micros();
            // Espera activa hasta completar 3 000 000 µs (3 s)
            while ((micros() - t_start) < 3000000U) {
                ; // no bloquea LCD, simplemente espera
            }
            HAL_GPIO_Write(&GPIOA_Info, BOMB_PIN, 0); // Bomba OFF

            // 6) Mostrar mensaje de bomba apagada 1 s
            LCD_command(0x01);
            delayMs(10);
            LCD_command(0x80);
            LCD_print("Bomba apagada");
            delayMs(1000);
        }
        else {
            LCD_print(" No hay dispo ");
            delayMs(2000);
        }

        // 7) Regresar al menú principal
        return 1;
    }
    // n=2 y n=3: todavía sin implementar
    return 0;
}

/* ==================== IMPLEMENTACIÓN HC-SR04 ==================== */
uint32_t medir_distancia_cm(void) {
    uint32_t startTime = 0, endTime = 0, pulseWidth = 0;
    uint32_t distance_cm = 0;

    // Asegurar TRIG en bajo
    HAL_GPIO_Write(&GPIOD_Info, TRIG_PIN, 0);
    delayUs(2);

    // Enviar pulso de 10 µs
    HAL_GPIO_Write(&GPIOD_Info, TRIG_PIN, 1);
    delayUs(10);
    HAL_GPIO_Write(&GPIOD_Info, TRIG_PIN, 0);

    // Esperar flanco de subida en ECHO (timeout 30 ms)
    uint32_t timeout = micros();
    while (HAL_GPIO_Read(&GPIOA_Info, ECHO_PIN) == 0) {
        if ((micros() - timeout) > 30000U) {
            return 0xFFFFFFFFU; // timeout
        }
    }
    startTime = micros();

    // Esperar flanco de bajada en ECHO (timeout 30 ms)
    timeout = micros();
    while (HAL_GPIO_Read(&GPIOA_Info, ECHO_PIN) == 1) {
        if ((micros() - timeout) > 30000U) {
            return 0xFFFFFFFFU; // timeout
        }
    }
    endTime = micros();

    pulseWidth = endTime - startTime; // ancho de pulso en µs
    distance_cm = (uint32_t)((float)pulseWidth / 58.0f); // fórmula aproximada
    return distance_cm;
}

/* ==================== FUNCIONES LCD ==================== */
void LCD_init(void) {
    // Habilitar reloj a puertos A y D
    SIM->SCGC5 |= SIM_SCGC5_PORTA_MASK | SIM_SCGC5_PORTD_MASK;

    // Configurar datos D4–D7 (PTD4–PTD7) como salida
    for (int i = 4; i <= 7; i++) {
        PORTD->PCR[i] = PORT_PCR_MUX(1);
    }
    PTD->PDDR |= 0xF0;

    // Configurar control RS (PTA2), RW (PTA4), EN (PTA5) como salida
    PORTA->PCR[2] = PORT_PCR_MUX(1);
    PORTA->PCR[4] = PORT_PCR_MUX(1);
    PORTA->PCR[5] = PORT_PCR_MUX(1);
    PTA->PDDR |= (RS | RW | EN);

    delayMs(30);

    // Secuencia de inicialización 4-bit
    PTA->PCOR = RS | RW;
    send_nibble(0x03);
    delayMs(10);
    send_nibble(0x03);
    delayUs(100);
    send_nibble(0x03);
    delayUs(100);
    send_nibble(0x02);

    LCD_command(0x28); // 4-bit, 2 líneas, 5x8
    LCD_command(0x06); // incremento, sin shift
    LCD_command(0x01); // clear display
    LCD_command(0x0F); // display ON, cursor ON, blink ON
}

void LCD_command(unsigned char command) {
    PTA->PCOR = RS | RW;
    send_nibble(command >> 4);
    send_nibble(command & 0x0F);
    if (command < 4) delayMs(4);
    else          delayMs(1);
}

void LCD_data(unsigned char data) {
    PTA->PSOR = RS;
    PTA->PCOR = RW;
    send_nibble(data >> 4);
    send_nibble(data & 0x0F);
    delayMs(1);
}

void send_nibble(unsigned char nibble) {
    PTD->PDOR &= ~0xF0;
    PTD->PDOR |= ((nibble & 0x0F) << 4);
    PTA->PSOR = EN;
    delayUs(1);
    PTA->PCOR = EN;
}

void LCD_print(char *str) {
    while (*str) {
        LCD_data((unsigned char)(*str));
        str++;
    }
}

/* ==================== FUNCIONES KEYPAD ==================== */
void keypad_init(void) {
    SIM->SCGC5 |= SIM_SCGC5_PORTC_MASK;
    // PTC0–PTC3 como filas (salida), PTC4–PTC7 como columnas (entrada con pull-up)
    for (int i = 0; i < 4; i++) {
        PORTC->PCR[i] = PORT_PCR_MUX(1);
    }
    for (int i = 4; i < 8; i++) {
        PORTC->PCR[i] = PORT_PCR_MUX(1) | PORT_PCR_PE_MASK | PORT_PCR_PS(1);
    }
    PTC->PDDR |= 0x0F; // PTC0–PTC3 salidas
    PTC->PSOR |= 0x0F; // filas en alto
}

char keypad_getkey(void) {
    int row;
    uint8_t col;
    const uint8_t row_select[4] = {0x01, 0x02, 0x04, 0x08};

    PTC->PSOR = 0x0F;
    delayUs(2);
    col = PTC->PDIR & 0xF0;
    if (col == 0xF0) return 0;

    for (row = 0; row < 4; row++) {
        PTC->PSOR = 0x0F;
        PTC->PCOR = row_select[row];
        delayUs(2);
        col = PTC->PDIR & 0xF0;
        if (col != 0xF0) break;
    }
    PTC->PSOR = 0x0F;
    if (row == 4) return 0;

    if (col == 0xE0) return row * 4 + 1;
    if (col == 0xD0) return row * 4 + 2;
    if (col == 0xB0) return row * 4 + 3;
    if (col == 0x70) return row * 4 + 4;
    return 0;
}

char convert_key(unsigned char key) {
    switch (key) {
        case  1: return '1';
        case  2: return '2';
        case  3: return '3';
        case  4: return 'A';
        case  5: return '4';
        case  6: return '5';
        case  7: return '6';
        case  8: return 'B';
        case  9: return '7';
        case 10: return '8';
        case 11: return '9';
        case 12: return 'C';
        case 13: return '*';
        case 14: return '0';
        case 15: return '#';
        case 16: return 'D';
        default: return ' ';
    }
}

/* ==================== TIEMPOS ==================== */
void SysTick_Init(void) {
    // SysTick a 1 µs por tick (48 MHz / 1e6 - 1)
    SysTick->LOAD = (SystemCoreClock / 1000000U) - 1U;
    SysTick->VAL  = 0;
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;
}

uint32_t micros(void) {
    static volatile uint32_t usTicks = 0;
    if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
        usTicks++;
    }
    return usTicks;
}

void TPM0_Init(void) {
    SIM->SCGC6 |= SIM_SCGC6_TPM0_MASK;
    SIM->SOPT2 |= SIM_SOPT2_TPMSRC(1); // 48 MHz
    TPM0->SC = 0;
    TPM0->CNT = 0;
    TPM0->SC = TPM_SC_PS(0) | TPM_SC_CMOD(1); // prescaler=1, habilitar
}

void delayUs(int n) {
    uint16_t start = (uint16_t)TPM0->CNT;
    uint16_t ticks = (uint16_t)(n * (SystemCoreClock / 1000000U));
    while ((uint16_t)(TPM0->CNT - start) < ticks) {
        ;
    }
}

void delayMs(int n) {
    for (int i = 0; i < n; i++) {
        delayUs(1000);
    }
}
